# Just do it

## 題目敘述
* 寫程式來計算數學算式似乎是一件再簡單不過的事了
* 然而(是的，所有的不幸事件都起源於這個然而)，你可曾想過，為了計算一道簡單的四則運算，曾經讓許多碼農死掉多少腦細胞....
* 為了堷養優秀青年們悲天憫人的同理心，菩薩心腸的老師決定使出霹靂手段，讓憂銹青年親自體會一下前人的辛勞
* 問題很簡單易懂，小學生都會算：讀入一段四則運算的題目，然後輸出答案
* 這問題看似簡單，實則不然，為了彰顯老師慈悲為懷的本性，這段四則運算只涉及個位數，而且，分以下部份給份：
1. 只計算加法：20%
2. 可計算加法及減法：30%
3. 可處理加減乘除：50%

## 輸入說明

一段個位數的四則運算

## 輸出說明

輸出計算結果(行尾需換行)

## 範例輸入
```
(1+2)+3
```

## 範例輸出
```
6
```

* 參考解答
#+begin_src C
#include<stdio.h>
long long int letranger(int n)
{
    printf("letranger(%ld)\n",n);
    if (n==1) {
       return 1;
    } else {
       return letranger(n-1)*letranger(n-1) + letranger(n-1) + 1;
    }
}

int main()
{
    printf("%ld\n", letranger(2));
    return 0;
}
#+end_src

#+RESULTS:
| letranger(2) |
| letranger(1) |
| letranger(1) |
| letranger(1) |
| 3            |
